app/controllers/archivos_controller.rb

  def index
    @archivos = Archivo.all
---
SELECT "archivos".* FROM "archivos"

  def create
    @archivo = Archivo.new(archivo_params)
    @archivo.my_file = params[:file]

    respond_to do |format|
      if @archivo.save
---
INSERT INTO "archivos" ("my_file", "created_at", "updated_at") VALUES (?, ?, ?)  [["my_file", "anuncio"], ["created_at", "2015-11-15 06:18:39.275646"], ["updated_at", "2015-11-15 06:18:39.275646"]]

    def set_archivo
      @archivo = Archivo.find(params[:id])
---
SELECT  "archivos".* FROM "archivos" WHERE "archivos"."id" = ? LIMIT 1  [["id", 1]]