app/controllers/empleados_controller.rb

  def index
    @empleados = Empleado.all
---
SELECT "empleados".* FROM "empleados"

  def create
    @empleado = Empleado.new(empleado_params)

    respond_to do |format|
      if @empleado.save
---
INSERT INTO "empleados" ("nombre", "edad", "puesto", "salario", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nombre", "kevin"], ["edad", 18], ["puesto", "contador"], ["salario", 10000], ["created_at", "2015-11-11 09:47:36.200208"], ["updated_at", "2015-11-11 09:47:36.200208"]]

  def update
    respond_to do |format|
      if @empleado.update(empleado_params)
---
UPDATE "empleados" SET "nombre" = ?, "edad" = ?, "puesto" = ?, "salario" = ?, "updated_at" = ? WHERE "empleados"."id" = ?  [["nombre", "Miguel "], ["edad", 25], ["puesto", "Gerente"], ["salario", 25000], ["updated_at", "2015-11-11 09:50:59.682107"], ["id", 1]]

    def set_empleado
      @empleado = Empleado.find(params[:id])
---
SELECT  "empleados".* FROM "empleados" WHERE "empleados"."id" = ? LIMIT 1  [["id", 1]]