app/controllers/medicinas_controller.rb

SELECT "medicinas".* FROM "medicinas"
---
  def index
    @medicinas = Medicina.all

INSERT INTO "medicinas" ("my_file", "created_at", "updated_at") VALUES (?, ?, ?)  [["my_file", "piramide_alimenticia.jpg"], ["created_at", "2015-11-15 05:20:58.413290"], ["updated_at", "2015-11-15 05:20:58.413290"]]
---
  def create
    @medicina = Medicina.new(medicina_params)
    @medicina.my_file = params[:file]

    respond_to do |format|
      if @medicina.save

SELECT  "medicinas".* FROM "medicinas" WHERE "medicinas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_medicina
      @medicina = Medicina.find(params[:id])