app/controllers/pacientes_controller.rb

  def create
    @paciente = Paciente.new(paciente_params)

    respond_to do |format|
      if @paciente.save
---
INSERT INTO "pacientes" ("nombre", "edad", "enfermedad", "tratamiento", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nombre", "Juana"], ["edad", 50], ["enfermedad", "Diabetes"], ["tratamiento", "Insulina"], ["created_at", "2015-11-10 17:32:28.818735"], ["updated_at", "2015-11-10 17:32:28.818735"]]

  def update
    respond_to do |format|
      if @paciente.update(paciente_params)
---
UPDATE "pacientes" SET "nombre" = ?, "updated_at" = ? WHERE "pacientes"."id" = ?  [["nombre", "Juana Paz"], ["updated_at", "2015-11-11 10:08:27.469889"], ["id", 1]]